<!-------------------------------------------文件名： 3_11.php-------------------------------->
<?php
/***************ereg()函数示例***********************/
if(ereg("^[1-9][0-9]*$",18))echo "匹配正整数<br>";
if(ereg("^-[1-9][0-9]*$",-18))echo "匹配负整数<br>";
if(ereg("^-?[1-9][0-9]*$",18))echo "匹配整数<br>";
if(ereg("^[1-9][0-9]*|0$",18))echo "匹配非负整数<br>";
if(ereg("^-[1-9][0-9]*|0$",-18))echo "匹配非正整数<br>";
if(ereg("^[1-9][0-9]*\.[0-9]*|0\.[0-9]*[1-9][0-9]*$",18.8))echo "匹配正浮点数<br>";
if(ereg("^-([1-9][0-9]*\.[0-9]*|0\.[0-9]*[1-9][0-9]*)$",-18.8))echo "匹配负浮点数<br>";
if(ereg("^-?([1-9][0-9]*\.[0-9]*|0\.[0-9]*[1-9][0-9]*|0?\.0+|0)$",18.8))echo "匹配浮点数<br>";
if(ereg("^[1-9][0-9]*\.[0-9]*|0\.[0-9]*[1-9][0-9]*|0?\.0+|0$",18.8))echo "匹配非负浮点数<br>";
if(ereg("^(-([1-9][0-9]*\.[0-9]*|0\.[0-9]*[1-9][0-9]*))|0?\.0+|0$",-18.8))echo "匹配非正浮点数<br>";
if(ereg("^[A-Za-z]+$","AbcdEfGH")) echo "匹配由26个英文字母组成的字符串,大小写均可<br>";
if(ereg("^[A-Z]+$","ABCDEFGH")) echo "匹配由26个大写英文字母组成的字符串<br>";
if(ereg("^[a-z]+$","abcdefgh")) echo "匹配由26个小写英文字母组成的字符串<br>";
if(ereg("^[A-Za-z0-9]+$","AbcdEfGH")) echo "匹配由数字和26个英文字母组成的字符串,字母大小写均可<br>";
if(ereg("^[A-Za-z0-9_]+$","AbcdEfGH_12345"))echo "匹配由数字、26个大小写英文字母或者下划线组成的字符串<br>";
/***************preg_match()函数示例***********************/
if(preg_match("/^[\xa1-\xff]+$/","中文")) echo "匹配中文字符<br>";
if(preg_match("/^\s*|\s*$/"," 首尾都是空白字符 ")) echo "匹配首尾空白字符<br>";
if(preg_match("/\w{2,4}:\/\/\w+.\w*.\w{2,3}$/","http://www.rzphp.com")) echo "匹配简单的网址<br>";
if(preg_match("/^[a-zA-Z][a-zA-Z0-9_]{4,15}$/","account_110")) echo "字母开头，允许5-16字节，允许字母数字下划线<br>";
if(preg_match("/\d{3}-\d{8}|\d{4}-\d{7}/","010-12345678")) echo "匹配国内电话号码<br>";
if(preg_match("/\d{6}/","261041")) echo "匹配中国邮政编码<br>";
if(preg_match("/\d{15}|\d{18}/","370712365478962215")) echo "匹配身份证15位或18位<br>";
if(preg_match("/\d+\.\d+\.\d+\.\d+/","127.0.0.1")) echo "匹配ip地址<br>";
?>